function getTdValue() {
    var sleep = function (time) {
        var startTime = new Date().getTime() + parseInt(time, 10);
        while (new Date().getTime() < startTime) {
        }
    };
    sleep(1000);
    var tableId = document.getElementById("hist_table");
    var times = Array();
    var ytm = Array();
    var high = Array();
    var low = Array();


    function findnum(str) {
        return str.slice(str.search(/\d/))
    }

    for (var i = 1; i < tableId.rows.length; i++) {
        let now_time = tableId.rows[i].cells[0].innerHTML
        if (times[times.length - 1] == now_time) {//去重

        } else {
            // console.log(now_time)
            let now_ytm = findnum(tableId.rows[i].cells[4].innerHTML)
            let l
            let h
            [l, h] = tableId.rows[i].cells[3].innerHTML.split("-")
            times.push(now_time)
            ytm.push(now_ytm)
            low.push(findnum(l))
            high.push(findnum(h))
        }

    }
    // console.log(times)
    price_fig_option.xAxis[0].data = times;
    price_fig_option.series[0].data = ytm;
    price_fig_option.series[1].data = low;
    price_fig_option.series[2].data = high;

    // console.log([times.length-1,ytm[ytm.length-1]])
    price_fig_option.series[0].markPoint.data[2].coord = [times.length - 1, parseFloat(ytm[ytm.length - 1])]
    price_fig_option.series[0].markPoint.data[2].value = '最新\n' + ytm[times.length - 1]
    price_fig_option.series[1].markPoint.data[0].coord = [times.length - 1, parseFloat(low[low.length - 1])]
    price_fig_option.series[1].markPoint.data[0].value = '' + low[times.length - 1]
    price_fig_option.series[2].markPoint.data[0].coord = [times.length - 1, parseFloat(high[high.length - 1])]
    price_fig_option.series[2].markPoint.data[0].value = '' + high[times.length - 1]
    price_fig.setOption(price_fig_option);
}

// getTdValue();


// 指定图表的配置项和数据
var price_fig_option = {
    title: {
        text: '价格变化趋势图',
        textStyle: {
            fontSize: 14,
        },
        left: 'center',
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            type: 'line',
            // lineStyle: {}
        },
        // formatter: ''
        // formatter:'{@bond_name}<br/>期限:{c}<br/>收益率:{b}',
        // formatter: function (param) {
        //     return 'nihao'+param;
        // },
    },
    legend: {
        data: ['均价', '低点', '高点'],
        left: 'right',
    },
    grid: {
        left: '5%',
        right: '5%',
        bottom: '10%',
        top: 50,
        containLabel: false
    },
    xAxis: [{
        type: 'category',
        // type: 'value',
        data: []
    }],
    yAxis: [{
        type: 'value',
        min: 'dataMin',
        axisLabel: {
            show: true,
            fontSize: 12,
        },
        axisLine: {
            show: true
        },
        splitLine: {
            show: true,
            lineStyle: {

                width: 1,
                type: 'solid'
            }
        }
    }],
    dataZoom: [{
        // start: 10,
        show: true,
        realtime: true,
        // type: "inside",
    }],

    series: [
        {
            name: '平均价格',
            type: 'line',
            smooth: true,
            data: [],
            // symbol: "none",
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'},
                    {type: 'min', name: '最小值'},
                    {
                        name: '最新',
                        coord: [],
                        symbolRotate: -90,
                        value: ''
                    }]
            }
        },
        {
            name: '低点',
            type: 'line',
            smooth: true,
            data: [],
            markPoint: {
                data: [
                    // {type: 'max', name: '最大值'},
                    // {type: 'min', name: '最小值'},
                    {
                        name: '最新',
                        coord: [],
                        symbolRotate: 180,
                        value: ''
                    }]
            }
        },
        {
            name: '高点',
            type: 'line',
            smooth: true,
            data: [],
            markPoint: {
                data: [
                    // {type: 'max', name: '最大值'},
                    // {type: 'min', name: '最小值'},
                    {
                        name: '最新',
                        coord: [],
                        symbolRotate: 0,
                        value: ''
                    }]
            }
        }
    ],
};

var price_fig = echarts.init(document.getElementById('price_fig'));

price_fig.setOption(price_fig_option);

function fetch_chain_data() {
    update_wait('加载中...');
    let product_type = $('#type').val()
    let product_name = $('#name').val()

    $.ajax({
        type: 'POST',
        url: "/fetch_chain_data",
        data: JSON.stringify({'type': product_type, 'name': product_name}),
        contentType: 'application/json',
        dataType: 'html',

        success: function (data) {
            document.getElementById('df_data').innerHTML = data
            // ec_lookback_option.xAxis[0].data = data.day;
            // ec_lookback_option.series[0].data = data.stg_r;
            // ec_lookback_option.series[1].data = data.idx_r;
            // ec_lookback.setOption(ec_lookback_option);
            update_wait('数据获取完成')
            getTdValue(); //画图

        },
        error: function () {
            update_wait('数据获取失败')
        }
    })
}

let type_name_dict = {
    '0': ['请选择种类'],
    'aluminum': ['氧化铝(广西)', 'A380铝合金', '低品铝矿(贵州)', 'A00铝(杭州)', '氧化铝(贵州)', 'φ100铝棒(临沂)', '片碱（西北）', '1060压花板(河南)', 'φ178铝棒(新疆)', 'φ120铝棒(临沂)', '生杂铝(保定)', 'φ120铝棒(广东)', '3系废铝边料', '型材铝(台州)', 'φ178铝棒(包头)', 'φ178铝棒(无锡)', '冰晶石', '1A60铝杆(内蒙)', '3102空调箔坯料(河南)', 'zorba', '无铁机铝', '3102空调箔坯料(山东)', '32%离子膜烧碱（广西折百价）', '32%离子膜液碱（山西折百价）', 'φ90铝棒(无锡)', '干净割胶铝线(台州)', '型材铝(天津)', '机件生铝(重庆)', '机件生铝(天津)', 'ZLD104铝合金', '低品铝矿(广西)', '1A60铝杆(河南)', '3003油箱料(内蒙)', '6101/6201铝杆(山东)', '氧化铝(连云港)', 'φ120铝棒(包头)', '6101/6201铝杆(河南)', '3003油箱料(山东)', '干净割胶铝线(佛山)', '50%石墨质', '干净割胶铝线(上海)', 'A356铝合金', '型材铝(上海)', '生杂铝(长葛)', 'A00铝(临沂)', '32%离子膜烧碱（陕西折百价）', 'φ90铝棒(河南)', '高品铝矿(山西)', '预焙阳极(华东)', '8011空调箔坯料(山东)', 'ZLD102铝合金', '华南ADC12', 'φ120铝棒(无锡)', '1060压花板(内蒙)', 'φ90铝棒(新疆)', '32%离子膜液碱（山东）', '3102空调箔坯料(内蒙)', '8030铝杆(广东)', '中国宏桥铝价', 'SMMA00铝(中原)升贴水', '1系废铝板料', 'φ90铝棒(广东)', '8011空调箔坯料(河南)', 'φ90铝棒(临沂)', 'A00铝(无锡)', '1100装饰板(山东)', 'A00铝(天津)', '8011空调箔坯料(内蒙)', '片碱（山东）', '澳洲氧化铝FOB', 'φ120铝棒(河南)', '生杂铝', '美国tense', 'SMMA00铝升贴水', '华东ADC12', '8011食品箔坯料(河南)', '32%离子膜液碱（河南折百价）', '高品铝矿(河南)', 'φ90铝棒(包头)', '预焙阳极(西北)', '低品铝矿(山西)', '型材喷涂料', '氧化铝(山东)', '1050/1060PS版基(河南)', '预焙阳极(西南)', '氟化铝', '6101/6201铝杆(广东)', '8011食品箔坯料(内蒙)', '氧化铝(山西)', '干净割胶铝线(天津)', '8030铝杆(山东)', '1060压花板(山东)', 'A00铝(重庆)', '生杂铝(重庆)', '干净机体(保定)', '8011食品箔坯料(山东)', '型材铝(佛山)', '型材毛料', '低品铝矿(河南)', '3003油箱料(河南)', 'AlSi9Cu3铝合金', '50%离子膜液碱（山东）', '1050/1060PS版基(内蒙)', 'ADC12日本CIF', '1050/1060PS版基(山东)', '预焙阳极(华中)', '高品铝矿(广西)', '打包易拉罐(上海)', 'SMM氧化铝', 'φ178铝棒(广东)', '破碎生铝(佛山)', '氧化铝(河南)', '8030铝杆(河南)', '打包易拉罐(佛山)', '1A60铝杆(山东)', '1100装饰板(河南)', '废旧报纸板(佛山)', '1A60铝杆(广东)', '水箱铝(天津)', '型材铝(长葛)', 'A00铝(沈阳)', '机件生铝(台州)', '破碎熟铝(佛山)', '石墨化', '西南ADC12', '沪铝粉', '片碱（内蒙古）', 'SMMA00铝(中原)', '6系铝屑', 'φ178铝棒(河南)', 'SMMA00铝(佛山)', '30%石墨质', '1100装饰板(内蒙)', '高品铝矿(贵州)', 'SMM铝合金ADC12', 'SMMA00铝', '干净割胶铝线(长葛)', '澳洲铝矿CIF', 'φ120铝棒(新疆)'],
    'antimony': ['锑锭99.65%FOB', '2#低铋锑锭', '(56.5-58.5)乙二醇锑(一等品)', '1#锑锭', '硫化锑精矿Sb≥55%', '0#锑锭', '99.5%三氧化二锑(国产)', '99.8%三氧化二锑(国产)', '三氧化二锑99.5%FOB', '2#高铋锑锭'],
    'bi-se-te': ['硒锭≥99.99%', '硒粉≥99.9%', '精铋CIF', '精铋', '硒锭≥99.9%', '二氧化硒', '硒粉≥99.9%CIF', '粗硒', '硒粉≥99.99%', '碲'],
    'chromium': ['南非40-42%铬精粉', '铬99A', '201/2B卷(无锡)', '430/2B卷(无锡)', '内蒙高碳铬铁', '四川高碳铬铁', '304/2B卷-毛边(无锡)', '青海（西北）高碳铬铁'],
    'copper': ['砷铜合金30%', '1#电解铜(西南)升贴水', '漆包线用杆（华南）', '1#电解铜(华东)升贴水', 'SMM1#电解铜', '电力行业用杆(西南)', '电力行业用杆（华南）', '金龙(HPb58-3A)', '湿法铜升贴水', '人民币洋山铜溢价', '金龙(CW617N)', 'SMM鹰潭8mm铜杆加工费(月度)', '漆包线', '盘面扣减', 'CIF进口粗铜(月)', '漆包线用杆（华北）', '1#电解铜(华北)升贴水', '8mm保阻杆（江西）', '硫酸铜', '升水铜', '沪铜粉', '铍铜合金3.0-3.6%', '湿法铜', '贵溪铜升贴水', 'SMM国际铜现货价格', '1#电解铜(西南)', '洋山铜溢价(仓单)', 'SMM鹰潭1#电解铜', '金龙(HPb59-1A)', 'Φ3mm无氧铜丝(软)', '平水铜升贴水', '平水铜', 'SMM广东湿法铜升贴水', '金龙(C3604)', 'SMM广东1#电解铜', '贵溪铜', '国产粗铜(月)', '洋山铜溢价(提单)', 'Φ3mm无氧铜丝(硬)', '升水铜升贴水', '1#电解铜(华东)', 'SMM广东1#电解铜升贴水\xa0', '1#电解铜(华北)', 'Φ8mm无氧铜杆', 'SMM广东湿法铜', '漆包线用杆（华东）', '金龙(HPb59-1)', '进口铜精矿指数(月)', '磷铜合金14%', 'SMM鹰潭1#电解铜升贴水', '电力行业用杆（华北）', 'SMM1#电解铜升贴水', '进口铜精矿指数(周)', '电力行业用杆（华东）'],
    'in-ge-ga': ['精铟CIF', '锗锭', '锗锭FOB', '精铟', '镓', '粗铟', '7N高纯镓', '二氧化锗', '6N高纯镓'],
    'lead': ['废电蓄(福建)', '电动车强磁(瓦片)', '汽蓄QA/80AH(广东)', '再生铅≥pb98.5', '再生精铅(广东/含税)', '废电蓄(广东)', '铅锑合金', '废电蓄(安徽)', 'Pb50内蒙TC(周)', '电蓄48V/20AH(江苏)', '汽车QW极板(河北)', '废电蓄(河北)', '废汽蓄门店>60AH', '还原铅(广东)', '汽车白PP', '废白壳', '摩托12N7(驰名)', 'Pb50湖南TC(周)', '废白壳(广东)', '汽蓄QW/45AH(驰名)', '再生精铅(安徽/含税)', '外化成极板(江苏)', '废黑壳(河南)', '电蓄48V/12AH(浙江)', '废黑壳(山东)', '再生精铅(江西/含税)', '废汽蓄门店<60AH', '废电蓄(浙江)', '电蓄48V/12AH(江苏)', '汽蓄QA/80AH(四川)', '再生精铅(山东)', '废白壳(山东)', '外化成极板(河南)', '无刷废电机(江苏)', '汽车QW极板(四川)', '废白壳(广西)', '内化成极板(河南)', '铅钙合金(安徽)', '废白壳(湖北)', '废黑壳(河北)', '汽车QA极板(河北)', 'SMM1#铅锭', '废电蓄(上海)', '废白壳(安徽)', 'Pb50云南TC(周)', '铅锑合金(广东)', '电动车强磁(长条)', '汽蓄QA/80AH(河北)', '再生精铅(安徽)', 'Pb50河南TC(周)', '废电蓄门店12AH', '电蓄48V/20AH(江西)', '还原铅(山东)', '汽蓄QA/105AH(广东)', '还原铅(江苏)', '黄丹(河北)', '还原铅(江西)', '废电蓄(河南)', '机动车废强磁(浙江)', '铅锑合金(河北)', '内化成极板加工费', '铅钙合金(江苏)', '再生精铅(河南)', '废黑壳(广东)', '废黑壳(贵州)', '有刷废电机(江浙)', '内化成极板(江苏)', '1#铅锭天津地区价', 'Pb50国产TC(月)', '黄丹(江苏)', '黄丹(河南)', '还原铅(安徽)', '1#铅锭河南地区价', '铅钙合金(河北)', '废黑壳(上海)', '1#南华铅', '铅钙合金(河南)', '电蓄48V/20AH(浙江)', '电动车ABS', '汽蓄QW/60AH(驰名)', '废白壳(河南)', '还原铅(河南)', '还原铅(四川)', '内化成极板(安徽)', '机动车废强磁(广东)', '内化成极板(江西)', '废白壳(浙江)', '汽车黑PP', '电蓄48V/12AH(河南)', '汽车QA极板(四川)', '铅钙合金(山东)', '电蓄48V/20AH(驰名)', '铅锑合金(山东)', '无刷废电机(浙江)', '废电蓄(贵州)', '再生精铅(江苏)', '汽车QA极板(广东)', '废白壳(河北)', '废电蓄(湖北)', '废黑壳(浙江)', '1#江铜铅', '废电蓄门店20AH', '汽车QW极板(广东)', '废电动车电池', '电蓄48V/12AH(驰名)', 'Pb50广西TC(周)', '废黑壳(广西)', '废黑壳(四川)', '三轮管式30kg(驰名)', '汽蓄QA/105AH(山东)', '外化成极板(安徽)', '废电蓄(四川)', '外化成极板(江西)', '再生精铅(河北/含税)', '废白壳(贵州)', '再生精铅', '废黑壳(安徽)', '外化成极板加工费', '铅烟道灰', '三轮管式35kg(驰名)', '废黑壳(湖北)', '废白壳(福建)', '废白壳(上海)', '铅锑镉合金', 'Pb60进口TC(月)', '铅锑合金(江苏)', '废黑壳(福建)', '汽蓄QA/105AH(河北)', '摩托12N8(驰名)', '废电蓄(广西)', '再生精铅(江苏/含税)', '废白壳(四川)', '电蓄48V/12AH(江西)', '汽蓄QA/105AH(四川)', '1#铅锭广东地区价', '还原铅(河北)', '废铅渣(安徽)', '汽蓄QA/80AH(山东)', '电蓄48V/20AH(河南)', '废黑壳', '电动车强磁(短条)', '废电蓄(山东)', '再生精铅(江西)'],
    'magnesium': ['镁合金AM60', '镁粉（20-80目）', '1#镁锭（府谷、神木）', '1#镁锭(闻喜)', '镁合金AM50', '1#镁锭(上海)', '镁合金AZ91D'],
    'manganese': ['钦州港澳洲Mn46%锰矿', '钦州港巴西Mn44%锰矿', '钦州港加蓬Mn44%锰矿', '天津港巴西Mn44%锰矿', '内蒙硅锰6517(承兑)', '电解锰(重庆)', '天津港南非半碳酸锰矿', '电解锰(湖南)', '电解锰(广西)', '电解锰FOB', '天津港澳洲Mn46%锰矿', '钦州港南非高铁锰矿', '钦州港南非半碳酸锰矿', '广西硅锰6517(承兑)', '天津港加蓬Mn44%锰矿', '电解锰(沪袋装)', '电解锰(沪桶装)', '天津港南非高铁锰矿', '电解锰(贵州)', '宁夏硅锰6517(承兑)', '电池级硫酸锰（出厂价）', '贵州硅锰6517(承兑)', '电解锰(主产地)', '广西硅锰6014(含税)'],
    'metal-scraps': ['美国黄杂铜', '欧洲柜装黄杂铜', '62黄铜边料(广东)', '生杂铝(保定)', '马达铜(Cu92-93%)', '马达铜(Cu92%-93%)', '破碎黄铜水箱', '破碎黄铜(Fe<3%)', '65黄铜边料(广东)', '3系废铝边料', '型材铝(台州)', '1#铜台州(Cu≈97%)', '干净通讯线铜米', '废白壳', 'zorba', '2#铜(Cu94%-96%)', '无铁机铝', '65黄铜边料(上海)', '火烧线(Cu95%-97%)', '干净割胶铝线(台州)', '型材铝(天津)', '机件生铝(重庆)', '机件生铝(天津)', '日本黄杂铜', '干净割胶铝线(佛山)', '废电线(Cu55%)', '干净割胶铝线(上海)', '型材铝(上海)', '生杂铝(长葛)', '光亮铜线(天津)', '环保锡渣', '含铅锡块', '光亮铜线(台州)', '1#铜(Cu≈97)(天津)', '锡口铜(90-91%)', '低氧杆(保定)', '光亮铜线(上海)', '1#光亮铜线', '1系废铝板料', '变压器铜(CU94-95％)', '马达铜(Cu91~92%)', '火烧线(Cu94%-96%)', '环保锡块', '生杂铝', '黄铜水箱', '美国tense', '马达铜(Cu92%-94%)', '62黄铜边料(上海)', '带壳废电机(Cu10%)', '型材喷涂料', '光亮铜(含税)', 'H59黄杂铜(Fe≈6-7%)', '低氧杆(天津)', '紫铜砖(93%)', '干净割胶铝线(天津)', '国产黄杂铜', '生杂铝(重庆)', '干净机体(保定)', '干净黄铜屑(车口、刨花)', '型材铝(佛山)', '型材毛料', '铜铝水箱(台州)', '1#铜上海(Cu≈97%)', '混合2#铜(Cu94%-95%)', '打包易拉罐(上海)', '光亮铜线(保定)', '废电动车电池', '破碎紫铜(89-90%)', '破碎生铝(佛山)', '含银锡块', '打包易拉罐(佛山)', '铜铝水箱(天津)', '紫杂铜保定(CU94%-96%)', '美国柜装黄铜(含税)', '火烧线(Cu95%-96%)', '废旧报纸板(佛山)', '水箱铝(天津)', '型材铝(长葛)', '打包缆粗', '1#铜广东(Cu≈97%)', '美国2#铜(Cu94~95%)', '含铅锡渣', '机件生铝(台州)', '破碎熟铝(佛山)', '美国柜装黄铜(Fe<2%)', '干净镀锡铜线', '磷铜边料(高精度)', '6系铝屑', '美国2#铜(含税)', '铜铝水箱(广东)', '通讯线铜米', '废黑壳', '纯锡块', '美国柜装黄铜水箱', '干净割胶铝线(长葛)'],
    'minor-metals': ['精铟CIF', '钨粉(出口)', '钛精矿(TiO2≥46%)', '精铋', '1#镁锭(闻喜)', '精铟', '镓', '金属砷', '99.5%三氧化二锑(国产)', '99.8%三氧化二锑(国产)', '钒', '1#镁锭(上海)', '1#镉锭条', '海绵锆', '二氧化硒', '钠(工业级)', '粗铟', '硫化锑精矿Sb≥55%', '2#高铋锑锭', '铌', '1#镁锭（府谷、神木）', '铼', '锗锭FOB', '2#低铋锑锭', '1#钼', '铬99A', '黑钨精矿≥65%', '碲', '钙99%电解(块)', '金属铯(Cs≥99.5%)', '钨粉(国产)', '海绵钛', '铍', '6N高纯镓', '仲钨酸铵(出口)', '硒锭≥99.99%', '钨铁≥70%', '镁粉（20-80目）', '锗锭', '硒粉≥99.9%', '钨铁75-85%', '碳酸铷(Rb2CO3≥99%)', '(56.5-58.5)乙二醇锑(一等品)', '金属铷(Rb≥99.5%)', '镁合金AM50', '0#锑锭', '钾(工业级)', '1#钨条', '钙98.5%还原(块)', '粗硒', '镁合金AZ91D', '碳化钨粉(出口)', '仲钨酸铵(国产)', '四氯化钛(99.9%)', '二氧化锗', '锑锭99.65%FOB', '镁合金AM60', '0#镉锭条', '高钛渣(TiO2≥90%)', '精铋CIF', '1#锑锭', '硒锭≥99.9%', '碳化钨粉(国产)', '碳酸铯(Cs2CO3≥99%)', '三氧化二锑99.5%FOB', '黑钨精矿≥55%', '硒粉≥99.99%', '7N高纯镓'],
    'new-energy': ['三元前驱体(811/动力)', '人造石墨（中端）', '湿法涂覆基膜（5μm+2μm）', '电解液（三元动力用）', '干法基膜（16μm）', '湿法基膜（9μm）', '湿法涂覆基膜（9μm+3μm）', '电池级硫酸镍', '电解液（钴酸锂用）', '天然石墨（高端）', '氢氧化锂(56.5%工业级/国产)', '氯化钴(≥24.2%/国产)', '磷酸铁锂(动力型)', '碳酸锂(99.2%工业零级/国产)', '磷酸铁锂（储能型）', '锰酸锂(动力型)', '锰酸锂(容量型)', '金属锂(≥99%,工、电/国产)', '四氧化三钴(≥72.8%/国产)', '三元材料（811/动力）', '电解液（磷酸铁锂用）', '湿法基膜（7μm）', '碳酸锂(99.5%电池级/国产)', '三元前驱体(523/动力)', '天然石墨（中端）', '硫酸钴(≥20.5%/国产)', '钴粉(-200目/国产)', '三元前驱体(622/动力)', '三元材料(622/动力)', '电解钴(≥99.8%/金、赞)', '湿法涂覆基膜（7μm+2μm）', '氢氧化锂(56.5%电池级粗颗粒/国产)', '碳酸钴(≥46%/国产)', '人造石墨（高端）', '三元材料(523/动力)', '钴酸锂(60%、4.35V/国产)', '三元前驱体(523/单晶)', '氧化钴(≥72%/国产)', '电池级硫酸锰（出厂价）', '湿法基膜（5μm）', '钴中间品(25%-35%,CIF中国)', '锂辉石精矿(6%,CIF中国)', '电解液（锰酸锂用）'],
    'nickel': ['电镀级硫酸镍', '菲律宾红土镍矿1.5%(CIF)', '8-12%高镍生铁(出厂价-山东)', '红土镍矿1.8%(FOB)', '菲律宾红土镍矿1.5%(FOB)', '8-12%高镍生铁(出厂价-内蒙古)', '镍豆升贴水', '8-12%高镍生铁(出厂价-辽宁)', '电池级硫酸镍', '1#进口镍沪镍合约升贴水', '1#金川镍沪镍合约升贴水', '氧化亚镍NiONi≥76%', '8-12%高镍生铁(出厂价-江苏)', '硫酸镍NiSO4·6H2O', '菲律宾红土镍矿0.9%(CIF)', '菲律宾红土镍矿0.9%(FOB)', '镍豆', 'SMM1#电解镍', '镍矿海运费菲律宾-连云港', '8-12%高镍生铁(出厂价)', '氯化镍NiCl2·6H2O', '1#金川镍', '红土镍矿1.8%(CIF)', '1.5-1.7%镍生铁(出厂价)', '1#进口镍', '镍矿海运费菲律宾-天津港'],
    'precious-metals': ['铱', '金99', '铑', '金95', '钯', '2#银', '银粉', '3#银', '1#银', '钌', '铂'],
    'rare-earth': ['镨钕金属', '氧化铽', '氧化镝', '金属钇', '氧化钇', '氧化铒', '氧化铈', '金属铈', '氧化镧', '镝铁合金', '镧铈金属(电池级)', '金属镨', '镨钕氧化物', '钬铁', '氧化钆', '氧化钕', '氧化铕', '金属镝', '氧化钬', '金属铽', '金属镧', '碳酸稀土', '电池级混合稀土金属', '氧化镨', '氧化钐', '镧铈金属(合金级)', '金属钕'],
    'silicon': ['411#硅(黄埔港)', '441#硅(天津港)', '411#金属硅粉', '华东ADC12', '421#硅FOB(黄埔港)', '2202#硅(华东)', '不通氧553#硅(昆明)', '441#硅(华东)', '441#硅FOB(黄埔港)', '华南ADC12', '411#硅(昆明)', '421#硅(天津港)', '441#金属硅粉', '不通氧553#硅(天津港)', '3303#硅FOB(黄埔港)', '2202#硅(黄埔港)', 'DMC', '不通氧553#硅FOB(黄埔港)', '2202#硅(昆明)', '3303#硅(昆明)', '441#硅(四川)', '3303#硅(上海)', '3303#硅(四川)', '通氧553#硅(昆明)', '421#硅招标(华东)', '2202#硅FOB(黄埔港)', '421#硅(昆明)', '三氯氢硅', '411#硅(四川)', '3303#硅(华东)', '411#硅(天津港)', '2202#硅(福建)', '441#硅(上海)', '421#硅(华东)', '553#金属硅粉', '421#硅(黄埔港)', '西南ADC12', '2202#硅(上海)', '421#金属硅粉', '421#硅(四川)', '521#硅(华东)', '441#硅(黄埔港)', '3303#硅(天津港)', '551#硅(昆明)', '通氧553#硅(华东)', '不通氧553#硅(华东)', '多晶硅', '441#硅(昆明)', '不通氧553#硅(福建)', '通氧553#硅(天津港)', '不通氧441#硅(福建)', '不通氧553#硅(上海)', '3303#硅(黄埔港)', '3303#硅(福建)', 'SMM铝合金ADC12', '不通氧553#硅(四川)', 'A356铝合金', '不通氧553#硅(黄埔港)'],
    'stainless-steel': ['304/No.1卷(佛山)', '304/2B卷-切边(无锡)', '201/2B卷(无锡)', '304/2B卷-毛边(佛山)', '304/2B卷-切边(佛山)', '430/2B卷(无锡)', '430/2B卷(佛山)', '201/2B卷(佛山)', '304/No.1卷(无锡)', '304/2B卷-毛边(无锡)'],
    'steel': ['61.5%日照港PB粉', '盘螺郑州(安钢)', '61%青岛港麦克粉', '螺纹北京-11:00(承钢)', '61.5%京唐港PB粉', '螺纹厦门(三钢)', '盘螺上海-17:00(沙钢)', '62.5%青岛港纽曼粉CFR价', '61.5%青岛港PB粉', 'MMi62%铁矿石海漂指数', '螺纹昆明(昆钢)', 'MMi65%铁矿石港口现货指数（青岛港，折美金）', '盘螺福州(三钢)', '盘螺南昌(南钢)', '65%巴西铁精粉CIF', '63.5%印度铁精粉CIF', '中板全国均价', '66%铁精粉-邯邢', '61.5%曹妃甸港PB粉CFR价', 'MMi62%铁矿石港口现货指数（青岛港）', '热卷上海-11:00(本钢)', 'MMi58%铁矿石港口现货指数（青岛港，折美金）', '高线全国均价', '盘螺杭州-17:00(沙钢)', '66%铁精粉-迁安', '盘螺成都(成实)', '螺纹南宁(万钢)', '64%铁精粉-代县', '64%铁精粉-武安', '65%铁精粉-淄博', '66%铁精粉-遵化', '盘螺西安(龙钢)', '盘螺上海-11:00(沙钢)', 'MMi62%铁矿石港口现货指数（青岛港，折美金）', '螺纹全国均价', '螺纹广州(冷钢)', '螺纹重庆(重钢)', '热卷上海-17:00(本钢)', '螺纹西安(龙钢)', '螺纹成都(成实)', '螺纹上海-17:00(沙钢)', '热卷杭州-11:00(宁钢)', '61.5%澳大利亚铁精粉FOB', '62.5%青岛港纽曼粉', '61.5%日照港PB粉CFR价', '盘螺长沙(萍钢)', '热卷天津-17:00(中铁)', '61.5%澳大利亚铁精粉CIF', '热卷武汉-11:00(武钢)', '螺纹南京(永钢)', '61.5%曹妃甸港PB粉', '63.5%印度铁精粉FOB', '热卷无锡-11:00(燕钢)', '螺纹福州(三钢)', '热卷全国均价', '螺纹长沙(涟钢)', '盘螺北京-11:00(河钢)', '螺纹成都(威钢)', '盘螺南京(永钢)', '螺纹贵阳(水钢)', '螺纹南昌(南钢)', '冷轧全国均价', '螺纹杭州-17:00(沙钢)', '65%铁精粉-临沂', '61%青岛港麦克粉CFR价', '盘螺南宁(万钢)', '热镀锌全国均价', '热卷乐从-11:00(燕钢)', '低合金板', 'MMi65%铁矿石海漂指数', '66%铁精粉-北票', 'MMi65%铁矿石港口现货指数（青岛港）', '螺纹武汉(鄂钢)', '螺纹郑州(安钢)', '螺纹北京-17:00(承钢)', '盘螺北京-17:00(河钢)', '热卷乐从-17:00(燕钢)', '61.5%京唐港PB粉CFR价', '螺纹上海-11:00(沙钢)', '65%铁精粉-鞍山', '盘螺武汉(鄂钢)', '61.5%青岛港PB粉CFR价', '65%巴西铁精粉FOB', '螺纹合肥(马钢)', '盘螺广州-14:00(万钢)', '热卷宁波-11:00(宁钢)', '盘螺厦门(三钢)', '热卷天津-11:00(中铁)', '盘螺杭州-11:00(沙钢)', '热卷唐山-11:00(唐钢)', '热卷张家港-11:00(沙钢)', '硬线', '热卷博兴-11:00(中铁)', '螺纹杭州-11:00(沙钢)', '62.5%块矿指数（青岛港，折美金）', 'MMi58%铁矿石港口现货指数（青岛港）', '62.5%块矿指数（青岛港）', '螺纹长沙(萍钢)'],
    'tin': ['40%锡精矿(云南)', '无铅焊锡', '氯化亚锡', '60%锡精矿加工费(江西)', '硫酸亚锡', '63A焊锡条', '60%锡精矿加工费(湖南)', 'SMM1#锡', '锡酸钠42%', '60A焊锡条', '40%锡精矿加工费(云南)', '60%锡精矿(湖南)', '二氧化锡', '锡粉', '60%锡精矿(广西)', '锡基轴承合金', '60%锡精矿加工费(广西)', '锡酸钠36.5%', '硫醇甲基锡', '60%锡精矿(江西)'],
    'tungsten': ['仲钨酸铵(出口)', '钨铁≥70%', '钨粉(出口)', '钨铁75-85%', '黑钨精矿≥65%', '碳化钨粉(国产)', '1#钨条', '钨粉(国产)', '黑钨精矿≥55%', '碳化钨粉(出口)', '仲钨酸铵(国产)'],
    'zinc': ['Zamak3锌合金（浙江）', 'SMM0#麒麟', 'Zamak3锌合金（江苏）', 'Zamak5锌合金福建加工费（周度）', 'Zamak5锌合金广东加工费（周度）', 'Zn50进口TC(月)', 'Zn50四川国产TC(周)', 'Zn50云南国产TC(周)', 'SMM0#葫锌', 'Zn50国产TC（周）', 'SMM0#南华', 'Zamak3锌合金', 'SMM1#锌锭', 'Zamak5锌合金浙江加工费（周度）', 'Zamak3锌合金福建加工费（周度）', 'Zamak3锌合金（福建）', '95%锌渣(华北)', 'Zn50广西国产TC(周)', 'Zn50国产TC(月)', 'Zamak5锌合金', '96%-97%锌渣(华北)', 'Zamak5锌合金（浙江）', 'Zn50湖南国产TC(周)', 'SMM1#锌锭溢价（广东）', 'SMM0#进口锌溢价(提单)', 'Zamak5锌合金（福建）', 'SMM0#锌锭溢价（广东）', 'SMM0#红鹭', '95%锌渣(华东)', '氧化锌≥99.7%', 'SMM0#锌锭', 'SMM0#岷山', 'Zn50陕西国产TC(周)', 'Zamak5锌合金江苏加工费（周度）', 'SMM0#江铜', '96%-97%锌渣(华东)', 'Zamak5锌合金（江苏）', 'SMM0#进口锌溢价(仓单)', 'Zn50内蒙古国产TC(周)', 'SMM0#锌锭溢价（天津）', 'SMM0#火炬', 'Zamak3锌合金江苏加工费（周度）', 'SMM0#锌锭溢价（宁波）', 'Zn50进口TC（周）', 'SMM0#双燕', 'Zamak5锌合金（广东）', 'Zamak3锌合金浙江加工费（周度）', 'SMM1#锌锭溢价（天津）', 'Zamak3锌合金（广东）', 'Zamak3锌合金广东加工费（周度）']
}

let type_list = ['0', 'copper', 'aluminum', 'lead', 'zinc', 'tin', 'nickel',
    'stainless-steel', 'chromium', 'precious-metals', 'steel',
    'manganese', 'silicon', 'new-energy', 'antimony', 'tungsten', 'in-ge-ga',
    'bi-se-te', 'magnesium', 'minor-metals', 'rare-earth', 'metal-scraps']
let type_chn_list = ['请选择', '铜', '铝', '铅', '锌',
    '锡', '镍', '不锈钢', '铬', '贵金属', '钢铁', '锰', '硅', '钴锂', '锑', '钨'
    , '铟镓锗', '铋硒碲', '镁', '小金属', '稀土', '废金属']
for (let i = 0; i < type_list.length; i++) {
    document.getElementById('type').options.add(new Option(type_chn_list[i], type_list[i]))
}

/* 根据选择的产品种类，修改产品名称 */
function add_name_list() {
    let product_type = $('#type').val()
    document.getElementById('name').options.length = 0
    let name_list = type_name_dict[product_type]
    for (let j = 0; j < name_list.length; j++) {
        document.getElementById('name').options.add(new Option(name_list[j], name_list[j]))
    }
}


$(window).resize(function () {
    price_fig.resize()
})
